Tekla Open API Reference for Tekla Structures 2025
AnalysisEdge.CopyData Method
 Copies data from another analysis edge.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void CopyData(
	AnalysisEdge Analysisedge
)
Public Sub CopyData (
	Analysisedge As AnalysisEdge
)
Parameters
Analysisedge
Type: Tekla.Structures.Analysis.AnalysisEdge
The analysis edge to copy data from.
See Also
Reference
AnalysisEdge Class
Tekla.Structures.Analysis Namespace